{
  "uuid": "4a1dccab-7a9e-4ea7-afa9-69a737a2e4a1",
  "lastMigration": 33,
  "name": "MoviesDemo API",
  "endpointPrefix": "",
  "latency": 550,
  "port": 3000,
  "hostname": "",
  "folders": [],
  "routes": [
    {
      "uuid": "64432b10-31a2-41d9-952c-8fec26f7bbda",
      "type": "http",
      "documentation": "Список популярных фильмов",
      "method": "get",
      "endpoint": "movies/popular",
      "responses": [
        {
          "uuid": "c9cedcb2-0632-4d58-887a-6fb68da53bf3",
          "body": "{\n  \"movies\": [\n    {\n      \"id\": 1,\n      \"title\": \"Побег из Шоушенка\",\n      \"description\": \"Мужчина оказывается в жестокой тюрьме за преступление, которого он, возможно, не совершал. Здесь царят страх и насилие, а выживают лишь те, кто умеет приспосабливаться.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/41f30ea243.webp\",\n      \"releaseYear\": 1994\n    },\n    {\n      \"id\": 2,\n      \"title\": \"Крестный отец\",\n      \"description\": \"В послевоенное время глава влиятельной криминальной семьи устраивает торжество и принимает тех, кто пришёл за помощью. Он уважаем, справедлив и решителен, для него важны честь и верность. Его младший сын, побывавший на фронте, ведёт спокойную жизнь вдали от криминала и не стремится участвовать в семейных делах. Однако обострение конфликта с конкурентами, пытающимися втянуть семью в опасный бизнес, приводит к покушению на отца. Сын неожиданно оказывается в центре событий. В попытке защитить близких он совершает решительный шаг, вступая в борьбу. Его внутренние принципы начинают меняться, и он постепенно превращается в жёсткого и расчётливого наследника.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/5470915c19.webp\",\n      \"releaseYear\": 1972\n    },\n    {\n      \"id\": 3,\n      \"title\": \"Темный рыцарь\",\n      \"description\": \"Город охватывает волна насилия и беззакония. Всё начинается с жестокого ограбления, в котором преступники устраняют друг друга, и лишь один, полный безумия, уходит с награбленным. В это время таинственный борец с преступностью объединяется с представителями закона, чтобы положить конец власти мафии. Один из них вдохновляет героя своим идеализмом, давая надежду на возможную спокойную жизнь и отказ от двойной личности. Однако личные чувства осложняют выбор. Тем временем преступный мир теряет равновесие: финансовые махинации, предательство и новая фигура, не признающая правил, переворачивают всё с ног на голову. Город стремительно скатывается в хаос.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/993757b5cb.webp\",\n      \"releaseYear\": 2008\n    },\n    {\n      \"id\": 4,\n      \"title\": \"Крёстный отец 2\",\n      \"description\": \"Фильм рассказывает о становлении и зрелости влиятельного криминального лидера. В одной сюжетной линии показано, как юный герой теряет семью, бежит в чужую страну и, оказавшись среди бедности и несправедливости, вступает на путь преступного мира. Проявив решимость и силу, он устраняет врага и получает уважение, становясь опорой для окружающих. Во второй линии раскрываются последствия его прошлого: герой, уже возглавляя могущественную организацию, сталкивается с предательством, угрозами и моральными дилеммами. Обе истории отражают, как трагедии и обстоятельства превращают человека в символ власти и страха.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/ca0f2246e2.webp\",\n      \"releaseYear\": 1974\n    },\n    {\n      \"id\": 5,\n      \"title\": \"12 разгневанных мужчин\",\n      \"description\": \"Группа людей с разными характерами и жизненным опытом собирается, чтобы вынести решение по сложному делу. Почти все склонны признать обвиняемого виновным без долгих раздумий, стремясь скорее завершить обсуждение. Однако один человек настаивает на том, чтобы взглянуть на ситуацию глубже. Его сомнения вызывают напряжение, но со временем заставляют остальных задуматься. Постепенно поверхностные суждения уступают место размышлениям. Участники спора начинают видеть истину в деталях, которых раньше не замечали. Их равнодушие сменяется ответственностью, а суждения — состраданием и желанием понять.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/d6f04f3f38.webp\",\n      \"releaseYear\": 1956\n    },\n    {\n      \"id\": 6,\n      \"title\": \"Властелин колец: Возвращение короля\",\n      \"description\": \"Древнее зло, заключённое в волшебном кольце, которое меняет и разрушает тех, кто им обладает. Главный герой — хоббит, которому поручено уничтожить это кольцо в огне горы, где оно было создано. Его сопровождают верный друг и таинственное существо, когда-то бывшее хоббитом, но ставшее чудовищем из-за кольца. Между спутниками возникают конфликты и сомнения, вызванные злой силой артефакта. Они сталкиваются с опасностями, включая смертоносных существ и враждебные армии, стремящиеся завладеть кольцом. Параллельно развивается борьба за власть в королевствах Средиземья, где объединённые силы противостоят надвигающейся тьме. Судьба всего мира зависит от храбрости и единства героев в борьбе с тьмой и искушением.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/3c31c48921.webp\",\n      \"releaseYear\": 2003\n    },\n    {\n      \"id\": 7,\n      \"title\": \"Список Шиндлера\",\n      \"description\": \"В период жестоких репрессий еврейское население оказывается запертым в гетто, где царит нищета и страх. Немецкий предприниматель, прибывший с целью открытия фабрики, использует свои связи с военными и чиновниками, чтобы получить разрешения и устроить производство. Он привлекает инвестиции от богатых евреев, которые не могут свободно распоряжаться своими средствами, предлагая им взамен товары для обмена. Управление фабрикой доверяется представителю еврейского сообщества, который, несмотря на сомнения, видит в этом шанс спасти людей. Многие соглашаются работать на предприятии, что даёт им временную защиту и возможность покинуть гетто. Благодаря хитрости и риску бизнесмена жизнь многих оказывается спасена, а его отношение к делу меняется от личной выгоды к борьбе за человеческие жизни.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/34a023a31e.webp\",\n      \"releaseYear\": 1993\n    },\n    {\n      \"id\": 8,\n      \"title\": \"Криминальное чтиво\",\n      \"description\": \"Два наёмных преступника, работающие на влиятельного босса, проводят свои дни, выполняя опасные задания и сталкиваясь с жестокими врагами. В редкие моменты отдыха они ведут живые разговоры, делятся историями и рассуждают о жизни. В одной из историй один из них спасает жену босса, оказавшуюся в тяжелом состоянии из-за передозировки, проявив решительность и храбрость. В другой герой сталкивается с неудачными грабителями, пытающимися совершить дерзкое преступление, и с помощью убеждения предотвращает катастрофу. Третья история рассказывает о боксёре, который нарушает договор с криминальным боссом, что приводит к опасной игре на выживание. Все эти переплетающиеся события показывают сложный и напряжённый мир преступности, где судьбы героев тесно связаны.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/11204274cc.webp\",\n      \"releaseYear\": 1994\n    },\n    {\n      \"id\": 9,\n      \"title\": \"Властелин колец: Братство кольца\",\n      \"description\": \"В далёком уголке большой страны живёт маленький народец, ведущий спокойную и мирную жизнь. Их привычный уклад нарушается, когда один из них получает в наследство загадочное кольцо — древний артефакт, обладающий огромной силой и способный привести к разрушению всего вокруг. Мудрый волшебник раскрывает, что кольцо принадлежало тёмному властителю и в руках зла может поглотить весь мир. Чтобы предотвратить катастрофу, герой вместе с друзьями отправляется в опасное путешествие к единственному месту, где кольцо можно уничтожить. Их путь полон испытаний и встреч с врагами и союзниками. Несмотря на скромный рост и слабость, маленькие жители показывают истинную силу — в дружбе, храбрости и верности, став героями, от которых зависит судьба мира.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/af40b4ec80.webp\",\n      \"releaseYear\": 2001\n    },\n    {\n      \"id\": 10,\n      \"title\": \"Хороший, плохой, злой\",\n      \"description\": \"В разгар ожесточённой войны две противоборствующие стороны сражаются, а за их спинами разгорается другая борьба — за большие деньги, спрятанные в тайнике. Жестокий преступник, узнав о сокровищах, решает их отыскать любой ценой. В то же время двое спутников, связанных странным союзом, охотятся друг на друга ради наград и выживания, балансируя между предательством и взаимовыручкой. Судьбы этих людей переплетаются с тайной о спрятанном богатстве, которое они пытаются найти, несмотря на непрекращающуюся опасность. Все они вынуждены объединиться, чтобы выжить и получить желанное богатство, но в этой игре каждый может оказаться предателем.\",\n      \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/27f35c17e4.webp\",\n      \"releaseYear\": 1966\n    }\n  ]\n}",
          "latency": 0,
          "statusCode": 200,
          "label": "",
          "headers": [],
          "bodyType": "INLINE",
          "filePath": "",
          "databucketID": "",
          "sendFileAsBody": false,
          "rules": [],
          "rulesOperator": "OR",
          "disableTemplating": false,
          "fallbackTo404": false,
          "default": false,
          "crudKey": "id",
          "callbacks": []
        }
      ],
      "responseMode": null,
      "streamingMode": null,
      "streamingInterval": 0
    },
    {
      "uuid": "1fce4a2b-ca14-4fb6-967c-a398260271e1",
      "type": "http",
      "documentation": "Получаем фильм по ID",
      "method": "get",
      "endpoint": "movie/:movieId",
      "responses": [
        {
          "uuid": "9d3380d3-9cda-4bfb-be1c-7b7be6437381",
          "body": "{\n  \"movie\": {\n    \"id\": 18194,\n    \"title\": \"Побег из Шоушенка\",\n    \"description\": \"Мужчина оказывается в жестокой тюрьме за преступление, которого он, возможно, не совершал. Здесь царят страх и насилие, а выживают лишь те, кто умеет приспосабливаться.\",\n    \"imageUrl\": \"https://img.ixbt.site/live/images/original/29/80/01/2025/06/08/41f30ea243.webp\",\n    \"releaseYear\": 1994\n  }\n}",
          "latency": 0,
          "statusCode": 200,
          "label": "",
          "headers": [],
          "bodyType": "INLINE",
          "filePath": "",
          "databucketID": "",
          "sendFileAsBody": false,
          "rules": [],
          "rulesOperator": "OR",
          "disableTemplating": false,
          "fallbackTo404": false,
          "default": false,
          "crudKey": "id",
          "callbacks": []
        }
      ],
      "responseMode": null,
      "streamingMode": null,
      "streamingInterval": 0
    }
  ],
  "rootChildren": [
    {
      "type": "route",
      "uuid": "64432b10-31a2-41d9-952c-8fec26f7bbda"
    },
    {
      "type": "route",
      "uuid": "1fce4a2b-ca14-4fb6-967c-a398260271e1"
    }
  ],
  "proxyMode": false,
  "proxyHost": "",
  "proxyRemovePrefix": false,
  "tlsOptions": {
    "enabled": false,
    "type": "CERT",
    "pfxPath": "",
    "certPath": "",
    "keyPath": "",
    "caPath": "",
    "passphrase": ""
  },
  "cors": true,
  "headers": [
    {
      "key": "Content-Type",
      "value": "application/json"
    },
    {
      "key": "Access-Control-Allow-Origin",
      "value": "*"
    },
    {
      "key": "Access-Control-Allow-Methods",
      "value": "GET,POST,PUT,PATCH,DELETE,HEAD,OPTIONS"
    },
    {
      "key": "Access-Control-Allow-Headers",
      "value": "Content-Type, Origin, Accept, Authorization, Content-Length, X-Requested-With"
    }
  ],
  "proxyReqHeaders": [
    {
      "key": "",
      "value": ""
    }
  ],
  "proxyResHeaders": [
    {
      "key": "",
      "value": ""
    }
  ],
  "data": [],
  "callbacks": []
}